<script lang="ts" setup>
import Detail from '../components/Detail.vue';
import mainImg from '../assets/img/rotating_gallery.jpg';
</script>
<template>
	<Detail :imgUrl="mainImg" siteUrl="https://yoshizawa888.github.io/rotating-gallery" gitUrl="https://github.com/yoshizawa888/rotating-gallery/">
		<p>
			Three.jsを触り始めて何を作ろうかと考えた時に、どこかで見たような複数の画像が回転している物を作ってみたいと思いました。<br />
			参考にしたくて探してみたのですが、同じ様な物は見つけられませんでしたが...<br />
			しかし、オブジェクトが10個円状に並んでいるものがあったのでそれを基盤に作り始めてみました。
		</p>
		<br />
		<p>
			どの様にしたら元のオブジェクトが画像にできるのか、画像を常に外側を向かせて回転させるにはなど、ただ画像を回転させるだけ色々課題がありました。<br />
			ありましたが、ここまでは概ねスムーズに実装できました。<br />
			思いの外早く完成してしまったため、もう少し手を加えようと考えました。
		</p>
		<br />
		<p>
			そこで、画像をクリックできる様にできたら面白そうと思い、その機能も実装してみました。<br />
			クリックしているオブジェクトを取得方法を探したのですが、マウスオーバーしているオブジェクトの取得方法ばかり出てきたのでその方法をクリックイベントに直すところから始まりました。<br />
			うまく動作してもクリックが残ってしまっていたり、画像を前に出した後空いたところにうまく戻る様にする処理など色々と試行錯誤が必要でした。<br />
			また、諸々を実装し終わった後にアニメーションをGSAPで実装してみたいと思いましたが、回転させる都合上サインコサインを使っておりその辺りがイマイチ上手くいかなかったので今回は全てJSでアニメーションさせています。<br />
			機会があればGSAPでサインコサインを使ったアニメーションも実装してみたいです。
		</p>
		<br />
		<p>
			この作品を作るにあたり3Dを扱う上でサインコサインの重要性が理解できました。<br />
			数学の知識はほとんど忘れてしまっていましたが、このアプリの場合はサインはX軸、コサインはZ軸くらいの認識で良かったのは幸いでした。<br />
			使っている画像に関して正直なんでも良かったのですが、せっかくなら好きなものをと思いポケモンにしてみました。<br />
			ちょうど良い画像の形で種類が多く、非常に使い勝手も良かったです。<br />
			最後に2段にしてそれでも隙間がとても空いていたのでテキストとパーティクルを散らせてみました。<br />
			拙いコードと拙すぎるデザインですが、ぜひ見てみてください。
		</p>
	</Detail>
</template>
